total = 100
if total < 200
  puts "合計は200未満です"
end

if total >=150 
  puts "合計は150以上です"
end


# if文とは
# 条件や状況に応じて実行内容を変えたい場合に使用します。
#基本の書き方は以下のようになります

# if 条件
#    処理　＃もし条件がtrueだったら処理を行う
# end

# 条件に当てはまればtrue,当てはまらなければfaldseという真偽判定を行い
# 条件に当てはまる（true）場合は、if~endまでの処理が行われます。
# また、この条件を記述するために欠かせない
# 「比較演算子」「論理演算子」がある

# 比較演算子：条件を比較して判定する際に使う

# 数値の大小を比較する演算子
# <  　#右辺の方が大きい
# <= 　#右辺の方が大きい、または等しい
# >  　#左辺の方が大きい
# >= 　#左辺の方が大きい、または等しい

# 数値や文字列を比較する演算子（同じ文字列かどうか　など）
# == 　#右辺と左辺が等しい
# != 　#右辺と左辺が等しくないとき
# 
# 
# 
# 
